api/app/views/users/profile.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categorisations" ON "categories"."id" = "categorisations"."category_id" WHERE "categorisations"."podcast_id" = ?  [["podcast_id", 24]]
---
        <div class="card-footer">
          <small class="text-muted">Categories: <% p.categories.each do |c| %><%= link_to c.name, "/podcasts?category=#{c.id}" %> | <% end %></small>