api/app/views/episodes/show.html.erb

  <div class="text-center">
      <%= (button_to((@user.favourite_episodes.include?(@episode) ? "unfavourite" : "favourite"), favouritisation_path)) if @user %>
---
SELECT  1 AS one FROM "episodes" INNER JOIN "favouritisations" ON "episodes"."id" = "favouritisations"."episode_id" WHERE "favouritisations"."user_id" = ? AND "episodes"."id" = ? LIMIT ?  [["user_id", 4], ["id", 41], ["LIMIT", 1]]