api/app/controllers/episodes_controller.rb

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."podcast_id" = ?  [["podcast_id", 18]]
SELECT COUNT(*) FROM "episodes" WHERE "episodes"."podcast_id" = ?  [["podcast_id", 3]]
SELECT "keywords".* FROM "keywords" INNER JOIN "keywordisations" ON "keywords"."id" = "keywordisations"."keyword_id" WHERE "keywordisations"."episode_id" = ?  [["episode_id", 9]]
SELECT "notes".* FROM "notes" WHERE "notes"."episode_id" = ?  [["episode_id", 41]]
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @episode = Episode.find(params[:id])
    @podcast = @episode.podcast
    @favouriters = @episode.favouriters
    @notes = @episode.notes
    @note = Note.new
    @keywords = @episode.keywords
    @user = current_user
    if @podcast.episodes.size > 1
      @siblings = @podcast.episodes.select{|e| e != @episode}

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def favouritisation
    episode = Episode.find(params[:id])