api/app/controllers/notes_controller.rb

  def create
    @note = Note.create(note_params)
---
INSERT INTO "notes" ("content", "episode_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "This is the most hilarious episode ever. "], ["episode_id", 44], ["user_id", 4], ["created_at", "2019-04-27 17:18:49.097146"], ["updated_at", "2019-04-27 17:18:49.097146"]]

  def edit
    if current_user.id != Note.find(params[:id]).user_id
      flash[:notice] = "Oops, you can't edit the note - it's not yours! Try something else instead?"
      redirect_to "/profile"
    else
      @note = Note.find(params[:id])
      @episode = Episode.find(@note.episode_id)
      @podcast = @episode.podcast
      @favouriters = @episode.favouriters
      @notes = @episode.notes
      @keywords = @episode.keywords
      @user = current_user
      if @episode.notes.size > 1
        @siblings = @episode.notes.select{|n| n != @note}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
SELECT "keywords".* FROM "keywords" INNER JOIN "keywordisations" ON "keywords"."id" = "keywordisations"."keyword_id" WHERE "keywordisations"."episode_id" = ?  [["episode_id", 41]]
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."episode_id" = ?  [["episode_id", 41]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."episode_id" = ?  [["episode_id", 41]]

  def update
    @note = Note.find(params[:id])
    @note.update(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "A very fresh take on customer journey!"], ["updated_at", "2019-04-27 17:11:02.378262"], ["id", 1]]

  def destroy
    note = Note.find(params[:id])
    note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]